Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Note that the full list of properties is available in the <<quarkus-kubernetes-client_quarkus-kubernetes-client-devservices-dev-services,Dev Services section of the configuration reference>>.
ja_jp: なお、プロパティの全リストは、 xref:quarkus-kubernetes-client_quarkus-kubernetes-client-devservices-dev-services[設定リファレンスのDev Servicesセクション] にあります。

source: Note that the full list of properties is available in the <<quarkus-kubernetes-client_section_quarkus-kubernetes-client-devservices,Dev Services section of the configuration reference>>.
ja_jp: なお、プロパティの全リストは、 xref:quarkus-kubernetes-client_section_quarkus-kubernetes-client-devservices[設定リファレンスのDev Servicesセクション] にあります。

source: Note that the full list of properties is available in the https://github.com/quarkusio/quarkus/blob/main/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] class.
ja_jp: プロパティーの完全なリストは、 link:https://github.com/quarkusio/quarkus/blob/master/extensions/kubernetes-client/runtime-internal/src/main/java/io/quarkus/kubernetes/client/runtime/KubernetesClientBuildConfig.java[KubernetesClientBuildConfig] クラスで確認できます。

source: Note that the full list of properties is available in the link:#quarkus-kubernetes-client_quarkus.kubernetes-client.devservices-dev-services[Dev Services section of the configuration reference].
ja_jp: なお、プロパティの全リストは、 link:#quarkus-kubernetes-client_quarkus.kubernetes-client.devservices-dev-services[コンフィギュレーションリファレンスのDev Servicesセクション] に掲載されています。

source: Note that the generate method returns a `Multi<Double>`, which implements the `Flow.Publisher` interface. This publisher will be used by the framework to generate messages and send them to the configured Pulsar topic.
ja_jp: generate メソッドは、 `Multi<Double>` を返します。これは、 `Flow.Publisher` インターフェイスを実装します。 このパブリッシャーは、メッセージを生成し、設定された Pulsar トピックに送信するために、フレームワークによって使用されます。

source: Note that the keystore and truststore type and provider are set to `BCFKS` and `BCFIPS`. One can generate a keystore with this type and provider like this:
ja_jp: keystore と truststore のタイプとプロバイダが `BCFKS` と `BCFIPS` に設定されていることに注意してください。このタイプとプロバイダでは、以下のようにキーストアを生成することができます。

source: Note that the line terminator is escaped with a backslash character `\` and white space at the start of the following line is ignored. I.e. `{msg:hello('Edgar')}` would be rendered as `Hello Edgar and good morning!`.
ja_jp: 行の終端はバックスラッシュ文字 `\` でエスケープされ、次の行の先頭の空白は無視されることに注意してください。つまり、`{msg:hello('Edgar')}` は `Hello Edgar and good morning!` とレンダリングされます。

source: Note that the method returns the specific type of `MeterRegistry` as a `@Singleton`. Use MicroProfile Config to inject any configuration attributes you need to configure the registry. Most Micrometer registry extensions, like `quarkus-micrometer-registry-statsd`, define a producer for registry-specific configuration objects that are integrated with the Quarkus configuration model.
ja_jp: このメソッドは、 `MeterRegistry` の特定の型を `@Singleton` として返すことに注意してください。レジストリーを設定するために必要な設定属性を注入するには、MicroProfile Configを使用します。 `quarkiverse-micrometer-registry-statsd` のようなほとんどのMicrometerのレジストリーエクステンションでは、Quarkusの設定モデルと統合されたレジストリー固有の設定オブジェクトのプロデューサを定義しています。

source: Note that the order of the specified proxy interfaces is significant. For more information, see link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/lang/reflect/Proxy.html[Proxy javadoc].
ja_jp: 指定されたプロキシーインターフェイスの順序は重要であることに注意してください。詳細は、link:https://docs.oracle.com/en/java/javase/17/docs/api/java.base/java/lang/reflect/Proxy.html[Proxy javadoc] を参照してください。

source: Note that the path above does not start with a '/', indicating it is a relative path. The above endpoint will be served relative to the configured non-application endpoint root. The non-application endpoint root is `/q` by default, which means the resulting endpoint will be found at `/q/custom-endpoint`.
ja_jp: 上記のパスが「/」で始まっていないのは、相対パスであることを示しています。上記のエンドポイントは、設定されたノンアプリケーションエンドポイントのルートからの相対パスで提供されます。アプリケーション以外のエンドポイントのルートは、デフォルトでは `/q` となっており、結果的にエンドポイントは `/q/custom-endpoint` にあることになります。

source: Note that the property `quarkus.kubernetes.output-directory` is relative to the current project location.
ja_jp: なお、プロパティー `quarkus.kubernetes.output-directory` は、現在のプロジェクトの位置からの相対的なものです。

source: Note that the reader endpoint of Elasticache for Redis (Cluster Mode Disabled) is a domain name which resolves to a CNAME record that points to one of the replicas. The CNAME record to which the reader endpoint resolves changes over time. This form of DNS-based load balancing does not work well with DNS resolution caching and connection pooling. As a result, some replicas are likely to be underutilized.
ja_jp: Elasticache for Redis (クラスターモードが無効) のリーダーエンドポイントは、レプリカの 1 つを参照する CNAME レコードに対して解決されるドメイン名であることに注意してください。 リーダーエンドポイントが解決する CNAME レコードは、時間の経過とともに変化します。 この形式の DNS ベースの負荷分散は、DNS 解決キャッシュおよび接続プールでは正しく機能しません。 その結果、一部のレプリカが十分に活用されない可能性があります。

source: Note that the rebalance listener methods are called from the Kafka polling thread and **will** block the caller thread until completion. That’s because the rebalance protocol has synchronization barriers, and using asynchronous code in a rebalance listener may be executed after the synchronization barrier.
ja_jp: リバランスリスナーメソッドは Kafka ポーリングスレッドから呼び出され、完了するまで呼び出し元のスレッドを**ブロック**することに注意してください。これは、リバランスプロトコルに同期バリアがあり、リバランスリスナーで非同期コードを使用すると、同期バリアの後に実行される可能性があるためです。

source: Note that the same feature will come to the Gradle plugin very soon.
ja_jp: なお、同じ機能は、まもなくGradleプラグインにも搭載される予定です。

source: Note that the service is not exposed to the outside world by default. So unless you've used the `quarkus.openshift.route.expose` config property to expose the created service automatically you'll need to expose the service manually.
ja_jp: なお、このサービスはデフォルトでは外部に公開されません。そのため、作成したサービスを自動公開する為に `quarkus.openshift.route.expose` configプロパティを使用しない限り、サービスを手動で公開する必要があります。

source: Note that the successful processing of the incoming record batch will commit the latest offsets for each partition received inside the batch. The configured commit strategy will be applied for these records only.
ja_jp: 着信レコードバッチの処理が成功すると、バッチ内で受信した各パーティションの最新のオフセットがコミットされることに注意してください。設定されたコミットストラテジーは、これらのレコードにのみ適用されます。

source: Note that the syntax `%regex[\...]` and `%ant[\...]` is _NOT_ supported.
ja_jp: 構文 `%regex[\...]` および `%ant[\...]` はサポートされていないことに注意してください。

source: Note that the test also needs to be updated. It could look like:
ja_jp: テストも更新する必要があることに注意してください。以下のようになります。

source: Note that the timeout was configured to 250 ms, and a random artificial delay between 0 and 500 ms was introduced into the `CoffeeResource#recommendations()` method.
ja_jp: なお、タイムアウトは250msに設定し、0～500msのランダムな人工的な遅延が `CoffeeResource#recommendations()` メソッドに導入されたことに注意してください。

source: Note that the timeout was configured to 250 ms, and a random artificial delay between 0 to 500 ms was introduced into the `CoffeeResource#recommendations()` method.
ja_jp: なお、タイムアウトは250msに設定し、0～500msのランダムな人工的な遅延を `CoffeeResource#recommendations()` メソッドに導入しました。

source: Note that the tokens issued by Keycloak have an `iss` (issuer) claim set to the realm endpoint address.
ja_jp: Keycloakが発行したトークンは、レルムエンドポイントアドレスが `iss` （発行者）クレームに設定されていることに注目してください。

source: Note that the topic configuration needs to reference full name of topics:
ja_jp: トピック設定では、トピックの完全な名前を参照する必要があることに注意してください。

source: Note that the virtual thread may not be re-mounted on the same carrier thread.
ja_jp: 仮想スレッドを同じキャリアースレッドに再マウントすることはできません。

source: Note that the xref:security-openid-connect-client.adoc[OidcClient] can also be used to acquire tokens.
ja_jp: なお、トークンの取得には link:security-openid-connect-client.adoc[OidcClient] を使用することもできます。

source: Note that there is a brief period of time between the old master failing and the new master being elected when the existing connections will temporarily fail all operations. After the new master is elected, the connections will automatically fail over and start working again.
ja_jp: 古いマスターが失敗してから新しいマスターが選出されるまでの短期間に、既存の接続ですべての操作が一時的に失敗する天に注意してください。 新しいマスターが選出されると、接続は自動的にフェイルオーバーされ、再び動作を開始します。

source: Note that there is no dependency on Mockito, you can use any mocking library you like, or even manually override the objects to provide the behaviour you require.
ja_jp: Mockitoには依存しないことに注意してください。好きなモッキングライブラリを使うことができますし、必要な動作を提供するためにオブジェクトを手動でオーバーライドすることもできます。

source: Note that these configuration properties are not the same ones as in your typical Hibernate ORM configuration file. They will often map to Hibernate ORM configuration properties but could have different names and don't necessarily map 1:1 to each other.
ja_jp: これらの設定プロパティーは、通常のHibernate ORMの設定ファイルにあるものとは異なることに注意してください。 多くの場合はHibernate ORMの設定のプロパティーに対応していますが、名前が異なる場合もあり、必ずしも1対1で対応しているわけではありません。

source: Note that these configuration properties are not the same ones as in your typical Hibernate Reactive configuration file. They will often map to Hibernate Reactive configuration properties but could have different names and don't necessarily map 1:1 to each other.
ja_jp: これらの設定プロパティは、典型的なHibernate Reactive設定ファイルにあるものと同じではないことに注意してください。これらはしばしばHibernate Reactive設定プロパティにマッピングされますが、名前が異なる可能性があり、必ずしも1対1でマッピングされるわけではありません。

source: Note that these features use the mapper managed by the `quarkus-jackson` extension. Refer to xref:rest-json.adoc#json[Jackson configuration] to customize the mapping.
ja_jp: なお、これらの機能は、 `quarkus-jackson` エクステンションで管理されているマッパーを使用しています。マッピングをカスタマイズするには link:rest-json.html#json[Jacksonの設定] を参照してください。

source: Note that this approach can also be used to change the channel configuration based on a profile.
ja_jp: このアプローチは、プロファイルに基づいてチャネル設定を変更する場合にも使用できることに注意してください。

source: Note that this configuration is a build time configuration, the property expression will be resolved at build time.
ja_jp: この設定はビルド時設定であり、プロパティ式はビルド時に解決されることに注意してください。

source: Note that this feature is provided by the REST Data with Panache extension that this extension is using under the hood. So, pure Spring Boot applications might not behave the same way.
ja_jp: なお、この機能は、このエクステンションがフード下で使用しているREST Data with Panacheエクステンションによって提供されています。そのため、純粋なSpring Bootアプリケーションでは、同じように動作しないかもしれません。

source: Note that this is an equivalent of the following code:
ja_jp: なお、これは以下のコードと同等のものです:

source: Note that this problem should only exhibit for extensions that are declared on the class level using `@ExtendWith` or their respective aliases. On top of that, they also need to operate with class loader early in their lifecycle - for example using the `ServiceLoader` mechanism in their constructors.
ja_jp: この問題は、`@ExtendWith` またはそれぞれのエイリアスを使用してクラスレベルで宣言されたエクステンションにのみ発生することに注意してください。さらに、それらはライフサイクルの早い段階でクラスローダーと連携する必要もあります。例えば、コンストラクターで `ServiceLoader` メカニズムを使用する場合などです。

source: Note that this will also remove the container (since we used `--rm` when we created it).
ja_jp: これにより、コンテナも削除されることに注意してください（作成時に `--rm` を使用したため）。

source: Note that to achieve this, an _admin connection_ is required. You can adjust the timeout for topic verification calls to the broker using the `health-topic-verification-timeout` configuration.
ja_jp: これを行うには、_admin connection_ が必要です。 `health-topic-verification-timeout` 設定を使用して、ブローカーへのトピック検証呼び出しのタイムアウトを調整することができます。

source: Note that to take advantage of these features, the `quarkus-test-kubernetes-client` dependency needs to be added, for example like so:
ja_jp: これらの機能を利用するには、例えば次のように `quarkus-test-kubernetes-client` 依存関係を追加する必要があることに注意してください。

source: Note that two profiles are configured. The `dist` profile configures the assembly plugin, and it's configured in such a way that it must be activated explicitly by passing `-Pdist` as a command flag. On the other hand the `dist-windows` profile becomes active automatically when the build is run on a Windows platform. This second profile takes care of setting the value for the `executable-suffix` property which is required by the assembly descriptor, as shown next:
ja_jp: 2 つのプロファイルが設定されていることに注意してください。 `dist` プロファイルはアセンブリプラグインを設定し、コマンドフラグとして `-Pdist` を渡すことによって明示的にアクティブ化する必要があるように設定されています。一方、ビルドが Windows プラットフォームで実行されると、 `dist-windows` プロファイルが自動的にアクティブになります。この 2 番目のプロファイルは、次に示すように、アセンブリ記述子に必要な `executable-suffix` プロパティーの値の設定を処理します。

source: Note that typical applications are likely bigger than quickstarts, so the memory requirements will also likely be higher.
ja_jp: 一般的なアプリケーションはクイックスタートよりも大きい可能性が高いため、メモリー要件も高くなる可能性があることに注意してください。

source: Note that unlike in the avro serialization, xref:kafka.adoc#serialization-autodetection[autodetect] can't be used with JSON Schema, so we must define the `value.serializer`. Just like with avro, we still have to define the `apicurio.registry.auto-register` property.
ja_jp: Avro シリアライゼーションとは異なり、xref:kafka.adoc#serialization-autodetection[自動検出] は JSON スキーマでは使用できないため、`value.serializer` を定義する必要があることに注意してください。 Avro の場合と同様に、`apicurio.registry.auto-register` プロパティーを定義する必要があります。

source: Note that we are not going to use Java serialization. https://github.com/infinispan/protostream[Protostream] is a serialization library based on Protobuf data format part of Infinispan. Using an annotation based API, we will store our data in Protobuf format.
ja_jp: なお、今回はJava標準のシリアライズは使用しません。 link:https://github.com/infinispan/protostream[Protostream] は、Infinispanの一部であるProtobufデータフォーマットに基づいたシリアライズライブラリです。アノテーションベースのAPIを使用して、Protobuf形式でデータを保存します。

source: Note that we decided here to return both the username and the password.
ja_jp: ここでは、ユーザー名とパスワードの両方を返すことにしました。

source: Note that we did not define any annotation such as `@RolesAllowed` to explicitly enforce access to a resource. The extension will be responsible to map the URIs of the protected resources you have in Keycloak and evaluate the permissions accordingly, granting or denying access depending on the permissions that will be granted by Keycloak.
ja_jp: リソースへのアクセスを明示的に強制するために、 `@RolesAllowed` のようなアノテーションを定義していないことに注意してください。エクステンションは、Keycloakにある保護されたリソースのURIをマッピングし、それに応じて許可を評価し、Keycloakによって付与される許可に応じてアクセスを許可または拒否する責任を負います。

source: Note that we differentiate two contexts where the solution applied might be different:
ja_jp: 適用されるソリューションが異なる可能性のある 2 つの文脈を区別していることに注意してください。

source: Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation provided by `quarkus-rest-qute`.
ja_jp: レンダリングはトリガーしないことに注意してください。これは、`quarkus-rest-qute` が提供する特別な `ContainerResponseFilter` 実装によって自動的に行われます。

source: Note that we don't trigger the rendering - this is done automatically by a special `ContainerResponseFilter` implementation.
ja_jp: レンダリングをトリガーしないことに注意してください - これは特別な `ContainerResponseFilter` の実装によって自動的に行われます。

source: Note that we removed the generated src directory because we just need the quarkus framework for running the coordinator.
ja_jp: 生成されたsrcディレクトリを削除したのは、コーディネーターを動かすためにquarkusフレームワークが必要なだけだからです。

source: Note that when a combination of `Optional*` types and defaults are used, the defined default value will still be used and if no value is given for the property, the `Optional*` will be present and populated with the converted default value. However, when the property is explicitly empty, the default value is not used and the `Optional` will be empty. Consider this example:
ja_jp: `Optional*` 型とデフォルト値を組み合わせて使用する場合、定義されたデフォルト値が引き続き使用されます。プロパティーに値が指定されていない場合、 `Optional*` が存在し、変換されたデフォルト値が入力されます。ただし、プロパティーが明示的に空の場合、デフォルト値は使用されず、 `Optional` は空になります。以下の例を考えてみましょう。

source: Note that when a combination of `Optional*` types and the `defaultValue` attribute are used, the defined `defaultValue` will still be used and if no value is given for the property, the `Optional*` will be present and populated with the converted default value. However, when the property is explicitly empty, the default value is not used and the `Optional` will be empty. Consider this example:
ja_jp: `Optional*` タイプと `defaultValue` 属性の組み合わせが使用される場合、定義された `defaultValue` が引き続き使用され、プロパティーに値が指定されていない場合、 `Optional*` が存在し、変換されたデフォルト値が入力されることに注意してください。ただし、プロパティーが明示的に空の場合、デフォルト値は使用されず、 `Optional` は空になります。この例を考えてみましょう。

source: Note that when the token is directly encrypted by the public RSA or EC key it is not possible to verify which party sent the token. Therefore the secret keys should be preferred for directly encrypting the tokens, for example, when using JWT as cookies where a secret key is managed by the Quarkus endpoint with only this endpoint being both a producer and a consumer of the encrypted token.
ja_jp: トークンが公開RSA鍵またはEC鍵によって直接暗号化される場合、どのパーティがトークンを送信したかを検証することは不可能であることに注意してください。 そのため、トークンを直接暗号化する場合は、秘密鍵を使用することを推奨します。例えば、JWTをクッキーとして使用する場合、秘密鍵はQuarkusのエンドポイントによって管理され、このエンドポイントだけが暗号化されたトークンの生成者にも消費者にもなります。

source: Note that when the token is directly encrypted by the public RSA or EC key it is not possible to verify which party sent the token. Therefore, the secret keys should be preferred for directly encrypting the tokens, for example, when using JWT as cookies where a secret key is managed by the Quarkus endpoint with only this endpoint being both a producer and a consumer of the encrypted token.
ja_jp: トークンが公開 RSA または EC キーによって直接暗号化されている場合、トークンの送信元は確認できないことに注意してください。したがって、トークンを直接暗号化するには秘密鍵を使用する必要があります。たとえば、JWT を Cookie として使用する場合、秘密鍵は Quarkus エンドポイントによって管理され、このエンドポイントのみが暗号化されたトークンのプロデューサーとコンシューマーになります。

source: Note that when using <<bytecode-recording,bytecode recording>>, the implicitly generated class can be declared to be weak by using the `optional` attribute of the `@io.quarkus.deployment.annotations.Record` annotation.
ja_jp: <<bytecode-recording,bytecode recording>> を使用する場合、暗黙的に生成されたクラスは、 `@io.quarkus.deployment.annotations.Record` アノテーションの `optional` 属性を使用して 弱い (weak) と宣言することができる点に注意してください。

source: Note that while accessing the `SunPKCS11` bridge provider is supported in native image, configuring `SunPKCS11` is currently not supported in native image at the Quarkus level.
ja_jp: `SunPKCS11` ブリッジプロバイダへのアクセスはネイティブイメージでサポートされていますが、 `SunPKCS11` の設定は現在 Quarkus レベルでネイティブイメージでサポートされていないことに注意してください。

source: Note that while applications using Stork do not use the Kubernetes service delegation, they still require a Kubernetes service to discover the backed pods. So, it does not change your Kubernetes deployment.
ja_jp: なお、Storkを使用するアプリケーションはKubernetesサービス委譲を使用しませんが、バックアップされたポッドを発見するためにKubernetesサービスが必要になります。そのため、Kubernetesのデプロイメントを変更することはありません。

source: Note that while having retries in a reliable system is a best practice, the `max.in.flight.requests.per.connection` parameter defaults to `5`, meaning that the order of the messages is not guaranteed. If the message order is a must for your use case, setting `max.in.flight.requests.per.connection` to `1` will make sure a single batch of messages is sent at a time, in the expense of limiting the throughput of the producer.
ja_jp: 信頼性の高いシステムにおいては再試行するのがベストプラクティスですが、 `max.in.flight.requests.per.connection` パラメーターのデフォルトは `5` で、これはメッセージの順序が保証されていないことを意味する点に注意してください。使用例でメッセージの順序が必須である場合、 `max.in.flight.requests.per.connection` を `1` に設定すると、一度に送信されるメッセージのバッチが 1 つになり、その分プロデューサーのスループットが制限されることになります。

source: Note that you can also configure them via annotations, check the `@ServiceDiscoveryType` and `@ServiceDiscoveryAttribute` annotations.
ja_jp: なお、これらの設定はアノテーションで行うこともできます。 `@ServiceDiscoveryType` と `@ServiceDiscoveryAttribute` のアノテーションをご覧ください。

source: Note that you can also use the `@Blocking` annotation when using @ClientExceptionMapper:
ja_jp: なお、@ClientExceptionMapperを使用する場合は、 `@Blocking` アノテーションを使用することも可能です:

source: Note that you can disable sharing the containers with `quarkus.keycloak.devservices.shared=false`.
ja_jp: `quarkus.keycloak.devservices.shared=false` でコンテナーの共有を無効にできることに注意してください。

source: Note that you can reference nested properties using the `.` (dot) separator as in `${x.factor}`.
ja_jp: なお、 `{x.factor}` のように、 `.` （ドット）セパレータを使って、ネストしたプロパティを参照することができます。

source: Note that you can reference nested properties using the `.` (dot) separator as in `{x.factor}`.
ja_jp: なお、 `{x.factor}` のように、 `.` （ドット）セパレータを使って、ネストしたプロパティを参照することができます。

source: Note that you can't access the injected `JsonWebToken` in the public methods if the token verification has not been done.
ja_jp: トークンの検証が実行されていない場合、パブリックメソッドで挿入された `JsonWebToken` にアクセスできないことに注意してください。

source: Note that you can't access the injected `JsonWebToken` through public methods if token verification has not been done.
ja_jp: トークンの検証が行われていない場合、挿入された `JsonWebToken` にパブリックメソッドを通じてアクセスできないことに注意してください。

source: Note that you do not have to inject the tokens - it is only required if the endpoint needs to use the ID token to interact with the currently authenticated user or use the access token to access a downstream service on behalf of this user.
ja_jp: 基本的にトークンを注入する必要はありません。エンドポイントが ID トークンを使用して現在認証されているユーザーとやりとりする必要がある場合や、アクセス・トークンを使用してこのユーザーに代わってダウンストリーム・サービスにアクセスする必要がある場合にのみ必要となります。

source: Note that you must have the https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] installed for this to work!
ja_jp: なお、これを実行するためには、 link:https://learn.microsoft.com/en-us/azure/azure-functions/functions-run-local#v2[Azure Functions Core Tools] がインストールされている必要があります！

source: Note that you need to be extremely careful here as anything in `META-INF/resources` will be exposed as static web resources. So this directory is not a shortcut for "let's automatically include these resources in the native executable" and should only be used for static web resources.
ja_jp: `META-INF/resources` にあるものはすべて、静的な Web リソースとして公開されるので、ここでは非常に注意が必要です。このディレクトリーは、「これらのリソースを自動的にネイティブ実行可能ファイルに含める」ためのショートカットではなく、静的な Web リソースのためにのみ使用する必要があります。

source: Note that you practically never want to configure `quarkus.redis.role=sentinel`. This setting means that the Redis client will execute commands directly on one of the sentinel servers, instead of an actual Redis server guarded by the sentinels.
ja_jp: 実際には、 `quarkus.redis.role=sentinel` を設定する必要はないことに注意してください。 この設定は、Redis クライアントが、sentinel によって保護されている実際の Redis サーバーではなく、sentinel サーバーの 1 つで直接コマンドを実行します。

source: Note that you should not call methods annotated with `@Incoming` and/or `@Outgoing` directly from your code. They are invoked by the framework. Having user code invoking them would not have the expected outcome.
ja_jp: コードから直接 `@Incoming` や `@Outgoing` のアノテーションが付けられたメソッドを呼び出してはならない点に注意してください。 これらはフレームワークによって呼び出されます。 ユーザーコードがそれらを呼び出すと、期待どおりの結果は得られません。

source: Note that you will also need to configure a token age property for the logout token verification to succeed if your OpenID Connect Provider does not set an expiry claim in the current logout token, for example, `quarkus.oidc.token.age=10S` sets a number of seconds that must not elapse since the logout token's `iat` (issued at) time to 10.
ja_jp: なお、OpenID Connect Providerが現在のログアウトトークンに有効期限を設定していない場合、ログアウトトークンの検証を成功させるためには、token ageプロパティも設定する必要があります。例えば、 `quarkus.oidc.token.age=10S` では、ログアウトトークンの `iat` (issued at) 時から経過してはならない秒数を10に設定します。

source: Note that, depending on how many resources you have in Keycloak the time taken to fetch them may impact your application startup time.
ja_jp: Keycloakにあるリソースの数によっては、それらを取得するのにかかる時間がアプリケーションの起動時間に影響することに注意してください。

source: Note that, even if your source code targets Java 11, we recommend to use the Java 17 images.
ja_jp: なお、ソースコードがJava 11を対象としている場合でも、Java 17のイメージを使用することをお勧めします。

source: Note that, if you want to push the validation errors to the frontend, you have to catch the exception and push the information yourselves as they will not be automatically pushed to the JSON output and will be treated as any other internal server errors.
ja_jp: 検証エラーをフロントエンドにプッシュしたい場合、例外をキャッチして自分で情報をプッシュする必要があることに注意してください。これは、エラーがJSON出力に自動的にプッシュされず、他の内部サーバーエラーと同様に扱われるためです。
